## Grouping And Aggregation of DataFrame
Aggregation is the proccess of grouping rows and converting them down into a single value by doing some calculation. It's done by using the group by method.

In [1]:
# Here is how to import pandas in your project
import pandas as pd;

In [2]:
df = pd.read_csv('../../titanic.csv', header=0)

1. Single Aggregation Function

In [3]:
# Get the average of the Fare price for male compare to female passanger
data = df
data[['Sex', 'Fare']].groupby('Sex').mean()

             Fare
Sex
female  44.479818
male    25.373130

In [4]:
# What is the average Age of the survived group?
data = df
data[['Survived', 'Age']].groupby('Survived').mean()

                Age
Survived
0         30.585681
1         28.343690

In [5]:
# Group number of embarked by Survived
data = df
data.groupby('Embarked')['Survived'].count()

Embarked
C    168
Q     80
S    646
Name: Survived, dtype: int64

In [6]:
# Group average price and age for male and female
data = df
data.groupby('Sex')[['Fare', 'Age']].mean()

             Fare        Age
Sex
female  44.479818  27.915709
male    25.373130  30.688286

2. Multi Aggregation Function

In [7]:
# Get Number of Passenger, mean Age, min Age and max Age for each Embarked port
data = df
data.groupby('Embarked')['Age'].agg(['count', 'mean', 'min', 'max'])

          count       mean   min   max
Embarked
C           130  30.814769  0.42  71.0
Q            28  28.089286  2.00  70.5
S           556  29.418615  0.67  80.0